import requests

# response = requests.get("https://petstore.swagger.io/v2/pet/12")
# if response.status_code == 200:
#     data = response.json()
    
#     print(data)
#     print(data["name"])
#     print(data["status"])


data = {
"город":"Санкт-Петербург",
"основан":1703,
"достопримечательности":[
{
"название":"Эрмитаж",
"тип":"музей",
"информация":{
    "адрес":"Дворцовая пл., 2",
    "год_основания":1764
}
},
{
"название":"Петропавловская крепость",
"тип":"крепость",
"информация":{
    "адрес":"Петропавловская крепость, 3",
    "год_основания":1703
}
}
]
}

# print(data["достопримечательности"][1].keys())
# print(data["достопримечательности"][1]["информация"]["год_основания"])


for i in data ["достопримечательности"]:
    print(i["название"])
    print(i["тип"])
    print(i["информация"]["год_основания"])
    print("***********************************")